In [91]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
%matplotlib inline
import matplotlib
matplotlib.rcParams["figure.figsize"]=(20,10)

In [92]:
df=pd.read_csv('Bengaluru_House_Data.csv')
df.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [93]:
df2=df.drop(['area_type','availability','society','balcony'],axis='columns')

In [94]:
df2.head()

                   location       size total_sqft  bath   price
0  Electronic City Phase II      2 BHK       1056   2.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2               Uttarahalli      3 BHK       1440   2.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                  Kothanur      2 BHK       1200   2.0   51.00

In [95]:
df2.isnull().sum()

location       1
size          16
total_sqft     0
bath          73
price          0
dtype: int64

In [96]:
df3=df2.dropna()

In [97]:
df3.isnull().sum()

location      0
size          0
total_sqft    0
bath          0
price         0
dtype: int64

In [98]:
df3.head()

                   location       size total_sqft  bath   price
0  Electronic City Phase II      2 BHK       1056   2.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2               Uttarahalli      3 BHK       1440   2.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                  Kothanur      2 BHK       1200   2.0   51.00

In [99]:
df3.shape

(13246, 5)

In [100]:
df3['size'].unique()

array(['2 BHK', '4 Bedroom', '3 BHK', '4 BHK', '6 Bedroom', '3 Bedroom',
       '1 BHK', '1 RK', '1 Bedroom', '8 Bedroom', '2 Bedroom',
       '7 Bedroom', '5 BHK', '7 BHK', '6 BHK', '5 Bedroom', '11 BHK',
       '9 BHK', '9 Bedroom', '27 BHK', '10 Bedroom', '11 Bedroom',
       '10 BHK', '19 BHK', '16 BHK', '43 Bedroom', '14 BHK', '8 BHK',
       '12 Bedroom', '13 BHK', '18 Bedroom'], dtype=object)

In [101]:
df3['BHK']=df3['size'].apply(lambda x: int(x.split(' ')[0]))

C:\Users\shris\AppData\Local\Temp/ipykernel_10776/1156995945.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3['BHK']=df3['size'].apply(lambda x: int(x.split(' ')[0]))

In [102]:
df3.head()

                   location       size total_sqft  bath   price  BHK
0  Electronic City Phase II      2 BHK       1056   2.0   39.07    2
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00    4
2               Uttarahalli      3 BHK       1440   2.0   62.00    3
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00    3
4                  Kothanur      2 BHK       1200   2.0   51.00    2

In [103]:
df3.total_sqft.unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [104]:
def is_float(x):
    try:
        float(x)
    except:
        return False
    return True

In [105]:
df3[~df3['total_sqft'].apply(is_float)]

                 location   size   total_sqft  bath    price  BHK
30              Yelahanka  4 BHK  2100 - 2850   4.0  186.000    4
122                Hebbal  4 BHK  3067 - 8156   4.0  477.000    4
137    8th Phase JP Nagar  2 BHK  1042 - 1105   2.0   54.005    2
165              Sarjapur  2 BHK  1145 - 1340   2.0   43.490    2
188              KR Puram  2 BHK  1015 - 1540   2.0   56.800    2
...                   ...    ...          ...   ...      ...  ...
12975          Whitefield  2 BHK   850 - 1060   2.0   38.190    2
12990      Talaghattapura  3 BHK  1804 - 2273   3.0  122.000    3
13059              Harlur  2 BHK  1200 - 1470   2.0   72.760    2
13265               Hoodi  2 BHK  1133 - 1384   2.0   59.135    2
13299          Whitefield  4 BHK  2830 - 2882   5.0  154.500    4

[190 rows x 6 columns]

In [106]:
df3.head()

                   location       size total_sqft  bath   price  BHK
0  Electronic City Phase II      2 BHK       1056   2.0   39.07    2
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00    4
2               Uttarahalli      3 BHK       1440   2.0   62.00    3
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00    3
4                  Kothanur      2 BHK       1200   2.0   51.00    2

In [107]:
def convert_sqft_to_num(x):
    tokens=x.split('-')
    if len(tokens)==2:
        return (float(tokens[0])+float(tokens[1]))/2
    try:
        return float(x)
    except:
        return None

In [108]:
convert_sqft_to_num('1200 - 1470')

1335.0

In [109]:
df4=df3.copy()

In [110]:
df4['total_sqft']=df4['total_sqft'].apply(convert_sqft_to_num)

In [111]:
df4.head()

                   location       size  total_sqft  bath   price  BHK
0  Electronic City Phase II      2 BHK      1056.0   2.0   39.07    2
1          Chikka Tirupathi  4 Bedroom      2600.0   5.0  120.00    4
2               Uttarahalli      3 BHK      1440.0   2.0   62.00    3
3        Lingadheeranahalli      3 BHK      1521.0   3.0   95.00    3
4                  Kothanur      2 BHK      1200.0   2.0   51.00    2

In [112]:
df5=df4.copy()
df5['price_per_sqft']=df5['price']*100000/df5['total_sqft']
df5.head()

,location,size,total_sqft,bath,price,BHK,price_per_sqft
0,Electronic City Phase II,2 BHK,1056.0,2.0,39.07,2,3699.810606
1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,120.00,4,4615.384615
2,Uttarahalli,3 BHK,1440.0,2.0,62.00,3,4305.555556
3,Lingadheeranahalli,3 BHK,1521.0,3.0,95.00,3,6245.890861
4,Kothanur,2 BHK,1200.0,2.0,51.00,2,4250.000000

In [113]:
df5=df5.drop('size',axis='columns')

In [114]:
df5.head()

                   location  total_sqft  bath   price  BHK  price_per_sqft
0  Electronic City Phase II      1056.0   2.0   39.07    2     3699.810606
1          Chikka Tirupathi      2600.0   5.0  120.00    4     4615.384615
2               Uttarahalli      1440.0   2.0   62.00    3     4305.555556
3        Lingadheeranahalli      1521.0   3.0   95.00    3     6245.890861
4                  Kothanur      1200.0   2.0   51.00    2     4250.000000

In [115]:
x=df5['location'].unique()

In [116]:
df5.shape

(13246, 6)

In [117]:
len(x
   )

1304

In [118]:
df5.location=df5.location.apply(lambda x: x.strip())
location_stats=df5.groupby('location')['location'].agg('count').sort_values(ascending=False)
location_stats.head(100)

location
Whitefield            535
Sarjapur  Road        392
Electronic City       304
Kanakpura Road        266
Thanisandra           236
                     ...
Mahadevpura            31
Kumaraswami Layout     30
Ananth Nagar           30
Doddathoguru           30
Chikkalasandra         30
Name: location, Length: 100, dtype: int64

In [119]:
len(location_stats[location_stats<=10])

1052

In [120]:
location_stats_less_than_10=location_stats[location_stats<=10]
location_stats_less_than_10

location
Basapura                 10
1st Block Koramangala    10
Gunjur Palya             10
Kalkere                  10
Sector 1 HSR Layout      10
                         ..
1 Giri Nagar              1
Kanakapura Road,          1
Kanakapura main  Road     1
Karnataka Shabarimala     1
whitefiled                1
Name: location, Length: 1052, dtype: int64

In [121]:
df5.location=df5.location.apply(lambda x: 'other' if x in location_stats_less_than_10 else x)

In [122]:
len(df5.location.unique())

242

In [123]:
df5.head(10)

                   location  total_sqft  bath   price  BHK  price_per_sqft
0  Electronic City Phase II      1056.0   2.0   39.07    2     3699.810606
1          Chikka Tirupathi      2600.0   5.0  120.00    4     4615.384615
2               Uttarahalli      1440.0   2.0   62.00    3     4305.555556
3        Lingadheeranahalli      1521.0   3.0   95.00    3     6245.890861
4                  Kothanur      1200.0   2.0   51.00    2     4250.000000
5                Whitefield      1170.0   2.0   38.00    2     3247.863248
6          Old Airport Road      2732.0   4.0  204.00    4     7467.057101
7              Rajaji Nagar      3300.0   4.0  600.00    4    18181.818182
8              Marathahalli      1310.0   3.0   63.25    3     4828.244275
9                     other      1020.0   6.0  370.00    6    36274.509804

In [124]:
df5.shape

(13246, 6)

In [125]:
df5['bhk_per_sqft']=df5['total_sqft']/df5['BHK']

In [126]:
df5

,location,total_sqft,bath,price,BHK,price_per_sqft,bhk_per_sqft
0,Electronic City Phase II,1056.0,2.0,39.07,2,3699.810606,528.00
1,Chikka Tirupathi,2600.0,5.0,120.00,4,4615.384615,650.00
2,Uttarahalli,1440.0,2.0,62.00,3,4305.555556,480.00
3,Lingadheeranahalli,1521.0,3.0,95.00,3,6245.890861,507.00
4,Kothanur,1200.0,2.0,51.00,2,4250.000000,600.00
...,...,...,...,...,...,...,...
13315,Whitefield,3453.0,4.0,231.00,5,6689.834926,690.60
13316,other,3600.0,5.0,400.00,4,11111.111111,900.00
13317,Raja Rajeshwari Nagar,1141.0,2.0,60.00,2,5258.545136,570.50
13318,Padmanabhanagar,4689.0,4.0,488.00,4,10407.336319,1172.25
13319,Doddathoguru,550.0,1.0,17.00,1,3090.909091,550.00

In [127]:
df5.to_csv('bengalore_house_2.csv',index=False)

In [128]:
df6=df5[df5['bhk_per_sqft']<300]

In [129]:
df6

,location,total_sqft,bath,price,BHK,price_per_sqft,bhk_per_sqft
9,other,1020.0,6.0,370.0,6,36274.509804,170.000000
45,HSR Layout,600.0,9.0,200.0,8,33333.333333,75.000000
58,Murugeshpalya,1407.0,4.0,150.0,6,10660.980810,234.500000
68,Devarachikkanahalli,1350.0,7.0,85.0,8,6296.296296,168.750000
70,other,500.0,3.0,100.0,3,20000.000000,166.666667
...,...,...,...,...,...,...,...
13277,other,1400.0,7.0,218.0,7,15571.428571,200.000000
13279,other,1200.0,5.0,130.0,6,10833.333333,200.000000
13281,Margondanahalli,1375.0,5.0,125.0,5,9090.909091,275.000000
13303,Vidyaranyapura,774.0,5.0,70.0,5,9043.927649,154.800000
13311,Ramamurthy Nagar,1500.0,9.0,250.0,7,16666.666667,214.285714

In [130]:
df6.shape

(744, 7)

In [131]:
df6.to_csv('bengaluru_house_detecton.csv',index=False)

In [132]:
df5.shape

(13246, 7)

In [133]:
df7=df5.copy()

In [134]:
df7.shape

(13246, 7)

In [135]:
df7.head()

,location,total_sqft,bath,price,BHK,price_per_sqft,bhk_per_sqft
0,Electronic City Phase II,1056.0,2.0,39.07,2,3699.810606,528.0
1,Chikka Tirupathi,2600.0,5.0,120.00,4,4615.384615,650.0
2,Uttarahalli,1440.0,2.0,62.00,3,4305.555556,480.0
3,Lingadheeranahalli,1521.0,3.0,95.00,3,6245.890861,507.0
4,Kothanur,1200.0,2.0,51.00,2,4250.000000,600.0

In [136]:
df8=df7[~(df7['bhk_per_sqft']<300)]

In [137]:
df8.head()

,location,total_sqft,bath,price,BHK,price_per_sqft,bhk_per_sqft
0,Electronic City Phase II,1056.0,2.0,39.07,2,3699.810606,528.0
1,Chikka Tirupathi,2600.0,5.0,120.00,4,4615.384615,650.0
2,Uttarahalli,1440.0,2.0,62.00,3,4305.555556,480.0
3,Lingadheeranahalli,1521.0,3.0,95.00,3,6245.890861,507.0
4,Kothanur,1200.0,2.0,51.00,2,4250.000000,600.0

In [138]:
df8.shape

(12502, 7)

In [139]:
df8.price_per_sqft.describe()

count     12456.000000
mean       6308.502826
std        4168.127339
min         267.829813
25%        4210.526316
50%        5294.117647
75%        6916.666667
max      176470.588235
Name: price_per_sqft, dtype: float64

In [140]:
def remove_pp_outliers(df):
    df_out=pd.DataFrame()
    for key,subdf in df.groupby('location'):
        m=np.mean(subdf.price_per_sqft)
        st=np.std(subdf.price_per_sqft)
        reduced_df=subdf[(subdf.price_per_sqft>(m-st))&(subdf.price_per_sqft<=(m+st))]
        df_out=pd.concat([df_out,reduced_df],ignore_index=True)
    return df_out


df9=remove_pp_outliers(df8)
df9.shape

(10241, 7)

In [141]:
def plotter_scatter_chart(df,location):
    bhk2=df[(df.location==location)&(df.bhk==2)]
    bhk3=df[(df.location==location)&(df.bhk==3)]
    matplotlib.rcParams('figure.figsize')=(15,10)
    plt.scatter(bhk2.price_per_sqft,bhk2.price,color='g',marker='+',s=50)
    plt.scatter(bhk3.price_per_sqft,bhk3.price,color='b',marker='+',s=50)

SyntaxError: cannot assign to function call (Temp/ipykernel_10776/2236056700.py, line 4)